Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes
Serialization structure for AnalysisPartBarAttributes.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._BarStartCondition
The bar start condition.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._BarEndCondition
The bar end condition.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._ForceStraightSegments
The straight force segments.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._SplitNodeCount
The count of the split node.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._NumberOfSplitDistances
The number of split distances.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._SplitDistances
The split distances.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._BarStartNumber
The start number of the bar.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes._MemberStartNumber
The start number of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes.ToStruct(Tekla.Structures.Analysis.AnalysisPartBarAttributes)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartBarAttributes.FromStruct(Tekla.Structures.Analysis.AnalysisPartBarAttributes)
DO NOT USE! For internal usage only!
P: P.